import React from "react";

const TermsOfService = () => {
  return (
    <div>
      <h1>服务条款</h1>
      <p>最后更新：2024.3.7</p>

      <h2>1. 引言</h2>
      <p>
        感谢您选择使用paperai（以下简称“我们的服务”）。在使用我们的服务前，请仔细阅读以下服务条款。通过使用我们的服务，您同意受这些条款的约束。
      </p>

      <h2>2. 使用条款</h2>
      <p>
        您同意不会使用我们的服务进行任何非法或未经授权的活动，并且您承诺遵守您所在国家/地区的所有法律和规定。
      </p>

      <h2>3. 账户注册与安全</h2>
      <p>
        为了使用某些功能，您可能需要注册账户。您同意提供真实、准确的信息，并且将及时更新此信息。保护您账户的安全性是您的责任。
      </p>

      <h2>4. 版权与内容所有权</h2>
      <p>
        我们尊重他人的知识产权，并期望用户也做到这一点。使用我们的服务不授予您任何知识产权的使用权。
      </p>

      <h2>5. 服务变更与终止</h2>
      <p>
        我们保留随时修改或终止服务（或其任何部分）的权利，且无需事先通知。我们对于任何修改、暂停或终止服务对您或任何第三方造成的影响不承担责任。
      </p>

      <h2>6. 免责声明与责任限制</h2>
      <p>
        我们的服务是按“现状”提供，不提供任何明示或暗示的保证。在适用法律允许的最大范围内，我们不对因使用我们的服务而产生的任何直接或间接损害承担责任。
      </p>

      <h2>7. 适用法律</h2>
      <p>这些条款将根据USA的法律进行解释和执行，不考虑其冲突法规定。</p>

      <h2>8. 联系我们</h2>
      <p>
        如果您对这些服务条款有任何疑问，请通过liuweiqing147@gmail.com与我们联系。
      </p>
    </div>
  );
};

export default TermsOfService;
